{
    "prepare": "Prepares a location for planting cannabis by choosing a strain, ensuring availability of seeds or clones, a digging tool, and fertilizer. The location becomes 'prepared' as a result.",
    "plant-it": "Plants a clone of a cannabis plant in a prepared location. The plant's status changes to 'planted' and 'growing'.",
    "fill-watering-can": "Fills an empty water container. The container is no longer considered 'empty' afterwards.",
    "germinate": "Initiates the germination process for a cannabis plant in a prepared location. The plant's status changes to 'germinating'.",
    "plant-germinated": "Plants a germinated cannabis seed in a prepared location. The plant's status changes to 'growing'.",
    "sow": "Plants cannabis seeds in a dug-up location. The plant's status changes to 'growing' and 'planted'.",
    "sprout": "Indicates that a planted cannabis plant starts to sprout and grow. Its status changes to 'growing'.",
    "top": "Cuts the upper part of a growing cannabis plant to encourage more bud sites. The plant's status changes to 'topped'.",
    "transition-to-flowering": "Changes the status of a growing and alive cannabis plant to 'flowering'.",
    "harvest": "Harvests a flowering and alive cannabis plant from a location. The plant's status changes to 'harvested', and it is no longer considered 'planted', 'alive', or 'growing'.",
    "dry-buds": "Starts the drying process for a harvested cannabis plant by placing it in a curing container. The plant's status changes to 'plant-drying'.",
    "water": "Waters an alive cannabis plant using a water container, making the location not dry. The water container becomes 'empty'.",
    "apply-mulch": "Applies mulch to a dug-up location. The location's status changes to 'mulched'.",
    "dig-soil": "Digs the soil at a prepared location using a digging tool. The location's status changes to 'dug'.",
    "amend-soil": "Adds soil amendments to a prepared location. The location's status changes to 'amended'.",
    "apply-fertilizer": "Applies fertilizer to a location. The location's status changes to 'fertilized'.",
    "apply-pesticide": "Applies pesticide to an infested, flowering, growing, and alive cannabis plant. The plant is no longer considered 'infested'.",
    "prune": "Prunes a flowering and growing cannabis plant using a pruning tool. The plant's status changes to 'pruned'.",
    "thin": "Thins out a growing cannabis plant to improve light penetration and air circulation. The plant's status changes to 'thinned'.",
    "train": "Trains a growing cannabis plant to grow in a particular shape or direction. The plant's status changes to 'trained'.",
    "add-biocontrol": "Applies biological controls to an infested, growing, and planted cannabis plant. The plant is no longer considered 'infested'.",
    "remove-weeds": "Removes weeds from an outdoor plot where a cannabis plant is growing and planted. The plot is no longer considered to have 'weeds'.",
    "cover": "Covers an outdoor plot experiencing freezing conditions to protect a growing cannabis plant. The plot's status changes to 'covered'.",
    "add-support-structure": "Adds a support structure to a growing cannabis plant. The plant's status changes to 'supported'.",
    "get-shovel": "Purchase or borrow a good quality spade or similar tool to loosen and dig soil.",
    "get-fertilizer": "Acquire a fertilizer that is high in nitrogen, such as 10-10-10 and another for flowering that is high in phosphorus, such as 5-11-5."
}