{
    "prepared": "Indicates that the soil or medium at a given location has been readied for planting, usually involving tilling and perhaps adding soil amendments.",
    "flowering": "Denotes that a cannabis plant is in the phase where it develops flowers, crucial for the production of buds.",
    "mulched": "Signifies that a layer of material (mulch) has been applied to the soil's surface at a given location to conserve moisture and improve soil conditions.",
    "fertilized": "Marks that nutrients (fertilizer) have been added to the soil at a specific location to promote plant growth.",
    "infested": "Indicates that a cannabis plant is suffering from an invasion of pests or diseases, which could negatively affect its health and yield.",
    "weeds": "Shows that the location has unwanted, invasive plants that may compete with the main crop for nutrients.",
    "dug": "Signifies that the soil at a given location has been dug up or tilled, often as a preparatory step for planting.",
    "planted": "Indicates that a cannabis plant has been sown or transplanted into a specific location.",
    "watered-plant": "Marks that water has been administered to a specific cannabis plant, essential for its growth and well-being.",
    "watered-location": "Indicates that a particular location has been watered, which could involve multiple plants or a plot of soil.",
    "matured": "Denotes that a cannabis plant has reached its full growth stage and is ready for harvest.",
    "alive": "Specifies that a cannabis plant is living and has not succumbed to disease, pests, or other detrimental conditions.",
    "growing": "Indicates that a cannabis plant is in an active state of growth but has not yet matured.",
    "has-shovel-available": "Signifies that a digging tool, such as a shovel, is available for tasks like digging or tilling.",
    "fertilizer-available": "Marks that fertilizer is available for enriching the soil to promote plant growth.",
    "growing-location-fertilized": "Indicates that the soil at a location where cannabis is growing has been fertilized.",
    "mulch-available": "Signifies that mulch is available for application to soil to improve its condition and retain moisture.",
    "water-container-available": "Marks that a water container, such as a watering can, is available for watering plants.",
    "has-indoor-pot-available": "Indicates that an indoor pot or container suitable for planting is available at the location.",
    "empty": "Specifies that a water container, like a watering can, is empty and needs to be refilled.",
    "dry": "Indicates that the soil at a given location lacks moisture and probably needs watering.",
    "unplanted": "Marks that a location is vacant and has not had any plants sown or transplanted into it.",
    "germinating": "Signifies that a cannabis plant is in the initial stage of its life cycle, where the seed begins to develop into a seedling.",
    "plant-in-curing-container": "Indicates that a harvested cannabis plant is in a container designed for curing, a process to improve the quality of the buds.",
    "plant-drying": "Signifies that a harvested cannabis plant is in the process of drying, a necessary step before curing or usage.",
    "freezing-conditions": "Marks that the conditions at an outdoor plot are below the freezing point, which is usually detrimental for cannabis plants.",
    "amendment-available": "Indicates that soil amendments, substances to improve soil quality, are available.",
    "amended": "Marks that soil amendments have been added to a specific location to improve the soil quality.",
    "has-seeds": "Specifies that a cannabis plant has produced seeds, which can be harvested for planting future crops.",
    "has-clones": "Indicates that a cannabis plant has clones, which are genetically identical plants grown from its cuttings.",
    "choose-strain": "Marks that a specific cannabis strain has been selected for planting, affecting characteristics like potency and yield.",
    "topped": "Indicates that the upper part of a cannabis plant has been cut off at a specific location to encourage bushier growth and more buds.",
    "has-outdoor-plot-available": "Marks that an outdoor plot is available for planting, offering more space but requiring consideration of environmental factors.",
    "harvested": "Specifies that a cannabis plant has been cut and collected, usually after reaching full maturity.",
    "pesticide-available": "Indicates that pesticide is available for treating plants that are infested with pests.",
    "pruning-tool-available": "Marks that a tool for pruning, such as shears, is available for tasks like cutting back branches to shape the plant.",
    "pruned": "Indicates that a cannabis plant has been selectively cut back to remove unnecessary leaves and branches.",
    "thinned": "Marks that excess leaves or branches from a cannabis plant have been removed to improve air circulation and light penetration.",
    "trained": "Signifies that a cannabis plant has been trained to grow in a particular shape or direction, often to maximize yield.",
    "covered": "Marks that an outdoor plot has been covered, often to protect plants from adverse weather conditions.",
    "support-structure-available": "Indicates that a structure like a trellis is available for supporting plants as they grow.",
    "supported": "Specifies that a cannabis plant has been given structural support, like stakes or trellises, to aid its growth.",
    "watering-scheduled": "Marks that a schedule has been set for watering a specific cannabis plant.",
    "fertilizer-scheduled": "Indicates that a fertilization schedule has been set for a specific cannabis plant.",
    "pest-control-scheduled": "Marks that a schedule for pest control treatment has been set for a specific cannabis plant.",
    "thinning-scheduled": "Indicates that a schedule for thinning excess leaves or branches from a cannabis plant has been set.",
    "training-scheduled": "Signifies that a schedule for training a cannabis plant to grow in a particular manner has been set.",
    "topping-scheduled": "Marks that a schedule for topping a cannabis plant to encourage bushier growth has been set.",
    "has-photoperiod-genetics": "Specifies that a cannabis plant has genetics that make it sensitive to light cycles, affecting its growth and flowering stages.",
    "has-autoflower-genetics": "Indicates that a cannabis plant has autoflowering genetics, meaning it will automatically transition to the flowering stage after a set period."
}